[
  {
    "title": "Python Programming 1",
    "bg": "hsla(54,100%,92%,100%)",
    "id": "beginner",
    "desc": "<p>This course is the first of an 8 month sequence introducing computer science through computer programming. This course will broaden your technical horizons, focus on systematic problem solving, and possibly change the way you look at the world. We welcome you and we hope you enjoy it.</p>",
    "level": 0,
    "labs": [
      {
        "id": 0,
        "title": "Hello World",
        "time": "1.5",
        "desc": "Get prepared. In this module, you'll meet your teachers, learn how to set up VS Code, and build your first application.",
        "instructions": [
          {
            "title": "Readings",
            "list": ["Prior to starting the project, skim through Chapter 1 of the <a href='https://drive.google.com/file/d/1FHCCM-UvUFFg6SOOouvSvRfEdaAuMx4z/view?usp=sharing'>Perkovic textbook </a>; it provides some background, including some issues we talked about in class.", "Lastly read sections 2.1 and 2.2 of the same text as it will help with the lab below.", "After you've finished the readings, you are ready to begin."]

          },
          {
            "title": "Setup",
            "list": ["Throughout these modules, we will be using a popular developer environment or IDE called VS Code. You can install VS Code for your respective OS (mac or windows) from the installation link <a href='https://code.visualstudio.com/' target='_blank'>here.</a>",
              "After installing VS Code, open the application and navigate to the extensions tab. (5th icon in the sidebar)", "Search for Python.", "Select the first one--it should be the one by Microsoft", "Hit Install", "It should take a second. Once the Python extension is finished installing you should be prompted to restart your VS Code--go ahead and restart it.", "That's it! Your VS Code is setup for the rest of the course!"
            ]
          },
          {
            "title": "Project Instructions",
            "list": ["Open VS Code", "You should be met with a Getting Started page. Go ahead and select <i>New File</i>.", "On the first line print \"Hello World\"", "Save this file with your first initial, last name, and lab number. So if your name is Shafee Masud, save the file as: <pre>smasud_00.py</pre>", "To run your code, open the terminal", "You can locate the terminal in the navigation bar of VS Code. Once you find it, select <i> New Terminal </i>", "Once you've opened a new terminal, type <pre>python3 smasud_00.py</pre>. Replace the filename here with yours.", "Check the terminal to see if it outputs \"hello world\""]
          }
          ,
          {"title": "Submission",
          "list": ["After saving your file, email your project to <pre>blackprntllc@gmail.com</pre>"]}
        ]
      },
      {
        "id": 1,
        "title": "Factorial",
        "time": "2",
        "desc": "In this module, you'll learn how to perform basic arithmetic, understand functions, parameters, and arguments. The primary function used throughout this module is called the factorial function (written in mathematical notation with an exclamation point, so `n factorial` would be n!).",
        "instructions": [
          {
            "title": "Setup",
            "list": [""]
          }
        ]
      }
    ]
  }
]
